import React from "react";
import styles from "./LabContainer.module.scss";
import { BlockMath, InlineMath } from "react-katex";

const VologMeta: React.FC = () => {
  return (
    <div className={styles.inputCard} style={{ marginBottom: "30px" }}>
      <h2 style={{ marginBottom: "6px" }}>Мета лабораторної роботи:</h2>
      <p style={{ margin: "0 0 16px 28px" }}>
        Визначити абсолютну і відносну вологість повітря психрометром Августа.
      </p>
      <h2 style={{ marginBottom: "6px" }}>Прилади та обладнання:</h2>
      <p style={{ margin: "0 0 16px 28px" }}>
        1. Психрометр Августа<br />
        2. Колба з дистильованою водою<br />
        3. Таблиця тиску насиченої водяної пари при різних температурах
      </p>
      <h2 style={{ marginBottom: "6px" }}>3. ХІД РОБОТИ </h2>
      <p style={{ margin: "0 0 0 28px" }}>
        1. Змочити тканину на резервуарі 2, для цього правий термометр занурити в колбочку з водою на 20 с.<br />
        
        2. Обережно, щоб не зірвати пружину, завести вентилятор.<br />
        
        3. На четвертій хвилині, після пуску вентилятора, зафіксувати температуру на правому термометрі.<br />
        
        4. Пружині вентилятора дати повністю розкрутитися, після чого дослід повторити.<br />
        
        5. Вимірювання <InlineMath math="t_2" /> необхідно зробити не менше 3-х разів, і результати занести в таблицю.<br />
        Значення <InlineMath math="E" /> і <InlineMath math="E'" /> беруть із таблиці в кінці роботи. (<InlineMath math="E" /> відповідає температурі <InlineMath math="t_2" />, а <InlineMath math="E'" /> температурі навколишнього повітря <InlineMath math="t_1" />). При користуванні таблицею значення <InlineMath math="E" /> та <InlineMath math="E'" /> перерахувати в системі СІ, тобто в Па.<br />
        Щоб перевести величини <InlineMath math="E'" /> і <InlineMath math="E" /> з мм.рт.ст. у Па необхідно скористатись наступною пропорцією, врахувавши що 1 мм.рт.ст. = 133,3 Па.<br />
        
        6. Величину <InlineMath math="e" /> визначити за формулою (4). Кінцевий результат для пружності водяних парів записати у вигляді:
        <BlockMath math="e = (e_{\text{сер}} \pm \Delta e_{\text{сер}}) \text{ Па}" />
        
        7. Відносну вологість визначити за формулою (1). Кінцевий результат записати у вигляді:
        <BlockMath math="r = (r_{\text{сер}} \pm \Delta r_{\text{сер}}) \, (\%)" />
      </p>
    </div>
  );
};

export default VologMeta;