import { BlockMath, InlineMath } from "react-katex";
import styles from "./LabContainer.module.scss";

const Yunga1Meta: React.FC = () => {


  return (
    <div className={styles.inputCard} style={{ marginBottom: "30px" }}>
      <h2 style={{ marginBottom: "6px" }}>Мета лабораторної роботи: </h2>
      <p style={{ margin: "0 0 16px 28px" }}>Визначити модуль пружності (модуль Юнга) для сталі при згині стержня.
      </p>
      <h2 style={{ marginBottom: "6px" }}>Прилади та обладнання: </h2>
      <p style={{ margin: "0 0 16px 28px" }}>1.	Прилад для визначення модуля пружності<br />
        2.	Індикатор<br />
        3.  Мікрометр<br />
        4.  Масштабна лінійка
      </p>
      <h2 style={{ marginBottom: "6px" }}>Хід роботи: </h2>
      <p style={{ margin: "0 0 0 28px" }}>1. За допомогою масштабнох лінійки вимірюють <InlineMath math="L" /> між ребрами опорних приз <InlineMath math="0" /> та <InlineMath math="0_{1}" />.<br />
        2.  За допомогою мікрометра вимірюють ширину <InlineMath math="b" /> та висоту <InlineMath math="h" /> стержня.<br />
        3.  Кладуть досліджуваний стержень на опорні призми так, щоб він був перпендикулярний їх ребрам. Підвішують скобу посередині між опорними призмами <InlineMath math="0" /> та <InlineMath math="0_{1}" />.<br />
        4.  Переміщуючи муфту <InlineMath math="M" />, встановлюють індикатор так, щоб його штифт уперся в стердень під ребром призми скобки. При цьому стрілка індикатора повернеться на кілька поділок, що засвідчує про відсутність щілини між штифтом індикатора і досліджуваним стержнем. Перед дослідом встановлюють індикатор на 0.<br />
        5.  Покласти на чашку скоби тягарці кожний з яких 5Н і визначити величину деформації <InlineMath math="f_{нав}" /> за допомогою індикатора. Навантаження довести до 25Н, а потім в зворотному порядку проводити розавнтаження, кожен раз знімаючи тягарці і визначаючи величину деформації індикатора <InlineMath math="f_{розв}" />. Визначити середню величину деформації прогину <InlineMath math="f_{сер}" /> при навтаженні і розвантаженні за формулою: <BlockMath math="\Delta f_{\text{сер}} = \frac{\Delta f_{\text{нав}} + \Delta f_{\text{розв}}}{2}" /><br />        
        6.  Побудувати графік залежності <InlineMath math="f_{сер}" /> від Ф при навантаженні і розвантаженні (вони практично зливаються в одну пряму лінію, що проходить через початок координат, оскільки при вказаних навантаженнях, деформація згину є пружиною). <br />
        7.  Обчислити значення модуля Юнга за формулою: <BlockMath math="E = \frac{L^3 F}{4 b h^3 f_{\text{сер}}}" />.<br />
        8.  Отриманні данні занести у таблицю.
      </p>
    </div>
  );
};

export default Yunga1Meta;
