import React from "react";
import styles from "./LabContainer.module.scss";
import { BlockMath, InlineMath } from "react-katex";

const PoverxMeta: React.FC = () => {
  return (
    <div className={styles.inputCard} style={{ marginBottom: "30px" }}>
      <h2 style={{ marginBottom: "6px" }}>Мета лабораторної роботи:</h2>
      <p style={{ margin: "0 0 16px 28px" }}>
        1. Вивчити явище поверхневого натягу. <br />
        2. Визначити коефіцієнт поверхневого натягу рідини.
      </p>
      <h2 style={{ marginBottom: "6px" }}>Прилади та обладнання:</h2>
      <p style={{ margin: "0 0 16px 28px" }}>
        1. Скляна бюретка з краном<br />
        2. Колбочка<br />
        3. Технічні терези з рівновагами<br />
        4. Мікрометр
      </p>
      <h2 style={{ marginBottom: "6px" }}>ХІД РОБОТИ: </h2>
      <p style={{ margin: "0 0 0 28px" }}>
        1. На технічних терезах з точністю до 1.0 мг зважити порожню колбочку для визначення маси <InlineMath math="M_0" />.<br />

        2. Підставити під капілярну трубку порожню колбочку і при відкритому крані наливають воду в воронку. Промити обладнання, слідкуючи за тим, щоб в трубці не утворювалися бульбашки повітря.<br />

        3. Закрити кран скляної бюретки заповненої водою. Користуючись краном змінити швидкість витікання води, намагаючись, щоб за хвилину відривалось не більше 8 – 10 крапель. Коли режим витікання буде встановлено, підставити колбочку, вага якої <InlineMath math="M_0" />, і відрахувати кількість крапель задану викладачем.<br />

        4. Визначити масу <InlineMath math="M" /> колбочки з краплями води.<br />

        5. Визначити з допомогою мікрометра діаметр капілярної трубки <InlineMath math="d" />.<br />

        6. Дослід повторити 3 рази.<br />

        7. Результати вимірювань занести в таблицю.<br />

        8. Поверхневий натяг обчислити за формулою:
        <BlockMath math="\sigma = \frac{M g}{n \pi d}" />

        9. Обчислити абсолютну та відносну похибки, кінцевий результат записують у вигляді:
        <BlockMath math="\sigma = (\sigma_{\text{сер}} \pm \Delta \sigma_{\text{сер}}) \, \text{Н/м}" />
      </p>
    </div>
  );
};

export default PoverxMeta;