import React from "react";
import styles from "./LabContainer.module.scss";
import { BlockMath, InlineMath } from "react-katex";

const AdiabMeta: React.FC = () => {
  return (
    <div className={styles.inputCard} style={{ marginBottom: "30px" }}>
      <h2 style={{ marginBottom: "6px" }}>Мета лабораторної роботи:</h2>
      <p style={{ margin: "0 0 16px 28px" }}>
        Визначити відношення молярних теплоємностей повітря методом адіабатичного розширення.
      </p>
      <h2 style={{ marginBottom: "6px" }}>Прилади та обладнання:</h2>
      <p style={{ margin: "0 0 16px 28px" }}>
        Установка для визначення коефіцієнта Пуассону газу методом адібатичного розширення
      </p>
      <h2 style={{ marginBottom: "6px" }}>Хід роботи: </h2>
      <p style={{ margin: "0 0 0 28px" }}>
        1. Для подачі повітря у сифон необхідно включити компресор і через деякий час, приблизно через 20 с, відкрити клапан, натиснувши ручку сифона.<br />

        2. Зафіксувати різницю рівнів рідини в манометрі відпустивши ручку сифона і зняти покази <InlineMath math="h_1" />, яке відповідає цій різниці.<br />

        3. Для сполучення сифона з атмосферою необхідно роз'єднавши трубку яка підведена до компресора, натиснути на ручку сифона на 1-2 секунди і знову відпустити.<br />

        4. Під'єднати трубку до сифона і після встановлення рівня рідини в манометрі, зняти показники <InlineMath math="h_2" />, яке відповідає цій різниці.<br />

        5. Дослід повторити 3 рази. Дані внести до таблиці.<br />

        6. Значення <InlineMath math="\gamma" /> знаходиться за формулою (13) для кожного досліду окремо:
        <BlockMath math="\gamma = \frac{h_1}{h_1 - h_2}" />

        7. Знайти похибку для кожного досліду, кінцевий результат записати у вигляді:
        <BlockMath math="\gamma = \gamma_{\text{сер}} \pm \Delta \gamma_{\text{сер}}" />
      </p>
    </div>
  );
};

export default AdiabMeta;