import React from "react";
import styles from "./LabContainer.module.scss";
import { BlockMath, InlineMath } from "react-katex";

const DensityMeta: React.FC = () => {
  return (
    <div className={styles.inputCard} style={{ marginBottom: "30px" }}>
      <h2 style={{ marginBottom: "6px" }}>Мета лабораторної роботи:</h2>
      <p style={{ margin: "0 0 16px 28px" }}>
        Ознайомитись із теорією густини та питомої ваги і експериментально
        визначити ці величини для тіла за допомогою ареометра.
      </p>
      <h2 style={{ marginBottom: "6px" }}>Прилади та обладнання:</h2>
      <p style={{ margin: "0 0 16px 28px" }}>
        1. Ареометр з постійним об'ємом<br />
        2. Посудина з водою<br />
        3. Експериментальні тіла<br />
        4. Терези
      </p>
      <h2 style={{ marginBottom: "6px" }}>Хід роботи: </h2>
      <p style={{ margin: "0 0 0 28px" }}>
        Згідно формули (1), для визначення питомої ваги даного тіла потрібно визначити його вагу <InlineMath math="P" /> та об'єм <InlineMath math="V" />.<br />

        а) визначення ваги:<br />
        Зануривши ареометр у воду і звільнивши його від бульбашок, навантажують верхню чашку ареометра різновагами до того часу, доки ареометр не зануриться в воду до риски. Нехай вага необхідних для цього різноваг дорівнює <InlineMath math="P_1" />.<br />
        Потім кладуть на верхню чашку ареометра досліджуване тіло і знімають частину різноваг, намагаючись, щоб ареометр знову занурився до тієї ж риски. Якщо вага різноваг, що залишилися в чашці, дорівнює <InlineMath math="P_2" />, то вага досліджуваного тіла в повітрі знаходиться за формулою:
        <BlockMath math="P = P_1 - P_2" />

        б) визначення об'єму:<br />
        Після визначення ваги тіла в повітрі досліджуване тіло перекладають з верхньої чашки ареометра на нижню. Якщо воно плаває, то його прив'язують. Для того, щоб утримати ареометр зануреним до риски, на верхню чашку добавляють різноваги. Якщо вага різноваг на верхній чашці буде дорівнювати <InlineMath math="P_3" />, то вага води <InlineMath math="P_{\text{в}}" />, що витіснило досліджуване тіло, дорівнюватиме:
        <BlockMath math="P_{\text{в}} = P_3 - P_2" />
        Об'єм <InlineMath math="V" /> тіла дорівнює об'єму води, витісненої тілом при його зануренні у воду, а об'єм води <InlineMath math="V_{\text{в}}" /> дорівнює вазі води <InlineMath math="P_{\text{в}}" />, поділеній на питому вагу води <InlineMath math="\gamma_{\text{в}}" /> при температурі досліду (тому що питома вага води залежить від температури):
        <BlockMath math="V = V_{\text{в}} = \frac{P_{\text{в}}}{\gamma_{\text{в}}}" />
        Підставляючи замість <InlineMath math="P_{\text{в}}" /> його значення, отримаємо:
        <BlockMath math="V = \frac{P_3 - P_2}{\gamma_{\text{в}}}" />
        Виходячи з отриманих формул, питома вага тіла <InlineMath math="\gamma" /> обчислюється як:
        <BlockMath math="\gamma = \frac{P_1 - P_2}{P_3 - P_2} \cdot \gamma_{\text{в}}" />

        Великий вплив на результати вимірювання можуть мати капілярні сили, що діють на ареометр. Тому при проведенні вимірювань необхідно слідкувати за тим, щоб поверхня води в посудині та ареометр були весь час чисті. Дослід необхідно зробити не менше чим три рази.<br />
        Величину <InlineMath math="\gamma_{\text{в}}" /> знаходять по таблиці, з урахуванням температури води. Можна вважати, що температура води дорівнює температурі повітря, якщо вода довгий час знаходилась в лабораторії. В цій роботі визначається питома вага тіла, густина якого більше густини води.
      </p>
    </div>
  );
};

export default DensityMeta;