import React from "react";
import styles from "./LabContainer.module.scss";
import { BlockMath, InlineMath } from "react-katex";

const PendulumMeta: React.FC = () => {
  return (
    <div className={styles.inputCard} style={{ marginBottom: "30px" }}>
      <h2 style={{ marginBottom: "6px" }}>Мета лабораторної роботи: </h2>
      <p style={{ margin: "0 0 16px 28px" }}>1.	Виміряти прискорення вільного падіння по періоду коливання
        математичного маятника.<br />
        2.	Визначити закони гармонічного коливального руху.
      </p>
      <h2 style={{ marginBottom: "6px" }}>Прилади та обладнання: </h2>
      <p style={{ margin: "0 0 16px 28px" }}>1.	Важка   кулька,   яка   підвішена   на   легкій   нитці,   що   не розтягується<br />
        2.	Секундомір
      </p>
      <h2 style={{ marginBottom: "6px" }}>Хід роботи: </h2>
      <p style={{ margin: "0 0 0 28px" }}>
        1. Штангенциркулем вимірюють діаметр <InlineMath math="D" /> кульки та довжину маятника. Довжина маятника знаходиться за формулою:
        <BlockMath math="l = l_0 + l_1 + \frac{D}{2}" />
        де <InlineMath math="l_0" /> – відстань від точки кріплення на стінці до місця кріплення нитки на кульці; <br />
        <InlineMath math="l_1" /> – відстань від місця кріплення нитки на кульці до поверхні кульки.<br />
        Вимірювання <InlineMath math="l" /> та <InlineMath math="D" /> необхідно робити не менше ніж три рази і взяти середні значення.<br />

        2. Для зменшення похибки при вимірюванні періода коливання маятника секундоміром вимірюють час, під час якого маятник робить (20,30,40,50) повних коливань, які робить маятник.<br />
        Після кількох повних коливань, коли кулька досягне крайнього правого положення, пускають секундомір і одночасно вимовляють голосно слово "нуль". Коли кулька знову повернеться в крайнє праве положення рахують "раз" і т.д. доки маятник не зробить потрібну (задану) кількість повних коливань, секундомір зупиняють.<br />
        Відрахунок по секундоміру, поділений на число коливань дозволяє отримати величину періода коливання маятника з точністю в сто разів більшою ніж точність його безпосереднього вимірювання.<br />
        Визначення тривалості кількості коливань маятника необхідно виконати що найменше три рази.<br />

        3. Дані усіх вимірювань записують у таблицю.<br />

        4. <InlineMath math="T" /> – період коливань маятника знаходиться за формулою:
        <BlockMath math="T = \frac{t}{N}" />
        де <InlineMath math="t" /> – час за який відбувається <InlineMath math="N" /> – повних коливань.<br />

        5. Прискорення вільного падіння знаходиться із формули періоду математичного маятника:
        <BlockMath math="g = \frac{4\pi^2}{T^2} \cdot l" />
      </p>
    </div>
  );
};

export default PendulumMeta;
