import React from "react";
import styles from "./LabContainer.module.scss";
import { BlockMath, InlineMath } from "react-katex";

const AdiabMeta: React.FC = () => {
  return (
    <div className={styles.inputCard} style={{ marginBottom: "30px" }}>
      <h2 style={{ marginBottom: "6px" }}>Мета лабораторної роботи:</h2>
      <p style={{ margin: "0 0 16px 28px" }}>
        Визначити відношення молярних теплоємностей повітря методом адіабатичного розширення.
      </p>
      <h2 style={{ marginBottom: "6px" }}>Прилади та обладнання:</h2>
      <p style={{ margin: "0 0 16px 28px" }}>
        1. Маятник Обербека <br />
        2. Масштабна лінійка <br />
        3. Секундомір <br />
        4. Штангенциркуль
      </p>
      <h2 style={{ marginBottom: "6px" }}>Хід роботи: </h2>
      <p style={{ margin: "0 0 0 28px" }}>
        1. Штангенциркулем вимірюють (<InlineMath math="d" /> шківа).<br />

        2. З допомогою масштабної лінійки вимірюють відстань <InlineMath math="h_0" /> між нижньою поверхнею вантажу і підлогою при повністю розкрученій нитці. Потім, обертаючи хрестовину, піднімають вантаж <InlineMath math="P" /> на висоту <InlineMath math="h" /> і знову роблять відлік з допомогою масштабної лінійки з точністю до 1 мм.<br />

        3. Вимірюють час падіння вантажу <InlineMath math="P" /> з висоти <InlineMath math="h" />, вмикаючи секундомір одночасно з початком обертання хрестовини і вимикаючи його при максимальному зниженні вантажу.<br />
        Після вимикання секундоміра слідкують за підйомом вантажу <InlineMath math="P" /> і відмічають з допомогою масштабної лінійки максимальну висоту підйому <InlineMath math="h_0" />. Ці вимірювання роблять 3 рази і записують результати у таблицю.<br />

        4. Оформити звіт, провести обчислення моменту інерції та обчислити абсолютну та відносну похибки, кінцевий результат записати у вигляді:
        <BlockMath math="I = (I_{\text{ср}} \pm \Delta I_{\text{ср}}) \text{ кг/м}^2" />
      </p>
    </div>
  );
};

export default AdiabMeta;